#### Terraform Format and Style: `failure`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_availability_zones.available: Reading...
aws_key_pair.rdx_key: Refreshing state... [id=rdx-key]
data.aws_ami.ubuntu: Reading...
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-0799a1469ccb6108c]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0778521d914d23bc1]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-05c0d051d078c47c0]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-06c9b56225cbb123e]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-03c0e6aedfaa5551b]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-02fe3683cd5342516]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-021cb8a1a41de96fc]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-0184acaea33d549d0]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-02e8b27a7394ec870]
aws_route_table.rdx_public_route_table: Refreshing state... [id=rtb-0332bb52363262b08]
aws_security_group_rule.rdx_public_security_group_rules_egress[0]: Refreshing state... [id=sgrule-4002268773]
aws_security_group_rule.rdx_public_security_group_rules_ingress[0]: Refreshing state... [id=sgrule-2358381367]
aws_security_group_rule.rdx_public_security_group_rules_ingress[2]: Refreshing state... [id=sgrule-1329947480]
aws_security_group_rule.rdx_public_security_group_rules_ingress[1]: Refreshing state... [id=sgrule-81192517]
aws_instance.full_node_ec2[0]: Refreshing state... [id=i-090aaa039bec5cd72]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-602147967]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d4ec180c2621d03f]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-043c66d000f9880a3]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cae618e9ee7731bf]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_eip.fullnode_ips[0]: Refreshing state... [id=eipalloc-0e5879071a1cc7e17]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.full_node_ec2[0] has changed
  ~ resource "aws_instance" "full_node_ec2" {
      ~ associate_public_ip_address          = false -> true
        id                                   = "i-090aaa039bec5cd72"
      + public_dns                           = "ec2-3-224-168-67.compute-1.amazonaws.com"
      + public_ip                            = "3.224.168.67"
        tags                                 = {
            "Name" = "Full Node 1"
        }
        # (28 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.example_secret[0] will be created
  + resource "github_actions_secret" "example_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "coding-challenge"
      + secret_name     = "IP"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Pushed by: @StatelessOddity, Action: `pull_request`*